Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: མུན་པ་མུན་ནག་དང་བྲལ་བ་ཞེས་བྱའོ། །ཐེ་ཙོམ་དང་བྲལ་བ་ཞེས་བྱའོ། །དོགས་པ་དང་བྲལ་བ་ཞེས་བྱའོ། །ཉོན་མོངས་པ་དང་བྲལ་བ་ཞེས་བྱའོ། །སོམ་ཉི་བཏུལ་བ་ཞེས་བྱའོ། །ཡིད་གཉིས་ཡང་དག་པར་བཅོམ་པ་ཞེས་བྱའོ། །ཆགས་པ་དང་བྲལ་བ་ཞེས་བྱའོ། །རྣམ་པར་གྲོལ་བ་ཞེས་བྱའོ། །རྣམ་པར་དག་པ་ཞེས་བྱའོ། །འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱའོ། །ཞེ་སྡང་དང་བྲལ་བ་ཞེས་བྱའོ། །གཏི་མུག་དང་བྲལ་བ་ཞེས་བྱའོ། །ཟག་པ་ཟད་པ་ཞེས་བྱའོ། །ཉོན་མོངས་པ་མི་མངའ་བ་ཞེས་བྱའོ། །དབང་དང་ལྡན་པར་གྱུར་པ་ཞེས་བྱའོ། །ཐུགས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་ཞེས་བྱའོ། །
en: He is the one without darkness, the one without pains, the one without yearnings, the one without disturbing emotions, the one who has eliminated hesitation, the one who has conquered doubt, the one without attachment, the one who is free, the pure one, the one without desire, the one without anger, the one without delusion, the one who has exhausted defilements, the one without disturbing emotions, the one with power, and the one whose mind is utterly free.

source: ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་ཞེས་བྱའོ། །ཅང་མཁྱེན་པ་ཞེས་བྱའོ། །གླང་པོ་ཆེན་པོ་ཞེས་བྱའོ། །བྱ་བ་མཛད་པ་ཞེས་བྱའོ། །བྱེད་པ་མཛད་པ་ཞེས་བྱའོ། །ཁུར་བོར་བ་ཞེས་བྱའོ། །རང་གི་དོན་རྗེས་སུ་བརྙེས་པ་ཞེས་བྱའོ། །སྲིད་པར་ཀུན་དུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ་ཞེས་བྱའོ། །མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་གྲོལ་བ་ཞེས་བྱའོ།
en: “He is called the one with the realization of a liberated one, the all-knowing one, the great elephant, the one who accomplishes things that need doing, the one who removes the burdens, the one who postpones his own benefit, the one who has exhausted all bonds to existence, and the one who has been freed by the wisdom of equality.

source: །སེམས་ཀྱི་དབང་དམ་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་བྱོན་པ་ཞེས་བྱའོ། །སྦྱིན་པའི་ཕ་རོལ་ཏུ་བྱོན་པ་ཞེས་བྱའོ། །ཚུལ་ཁྲིམས་ཀྱིས་མངོན་པར་འཕགས་པ་ཞེས་བྱའོ། །བཟོད་པའི་ཕ་རོལ་ཏུ་བྱོན་པ་ཞེས་བྱའོ། །བརྩོན་འགྲུས་ཀྱིས་མངོན་པར་འཕགས་པ་ཞེས་བྱའོ། །བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་བརྙེས་པ་ཞེས་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་བྱོན་པ་ཞེས་བྱའོ། །སྨོན་ལམ་གྲུབ་པ་ཞེས་བྱའོ། །
en: “He is called the one who has perfected all supreme powers of the mind, the one who has perfected generosity, the most sublime through discipline, the one who has perfected patience, the most sublime through diligence, the one who has discovered higher knowledge through concentration, the one who has perfected knowledge, and the one who has accomplished aspiration.

source: བྱམས་པ་ཆེན་པོ་ལ་གནས་པ་ཞེས་བྱའོ། །སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པ་ཞེས་བྱའོ། །དགའ་བ་ཆེན་པོ་ལ་གནས་པ་ཞེས་བྱའོ། །བཏང་སྙོམས་ཆེན་པོ་ལ་གནས་པ་ཞེས་བྱའོ།
en: “He is called the one who abides in great love, the one who abides in great compassion, the one who abides in great rejoicing, and the one who abides in great equanimity.

source: །སེམས་ཅན་བསྡུ་བ་ལ་བརྩོན་པ་ཞེས་བྱའོ། །སྒྲིབ་པ་མེད་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་བརྙེས་པ་ཞེས་བྱའོ། །རྟོན་པར་གྱུར་པ་ཞེས་བྱའོ། །བསོད་ནམས་ཆེན་པོ་ཞེས་བྱའོ། །ཡེ་ཤེས་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He is called the one who is diligent in gathering sentient beings, the one who has discovered undimmed awareness of everything, the one who is each and everyone’s refuge, the one of great merit, the one possessing great wisdom, and the one with perfect mindfulness, mode of thinking, and intellect.

source: །དྲན་པ་དང་བློ་གྲོས་དང་རྟོགས་པ་དང་བློ་ཕུན་སུམ་ཚོགས་པ་ཞེས་བྱའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་གིས་སྣང་བ་བརྙེས་པ་ཞེས་བྱའོ།
en: “He is known as the one who attained the light because he possesses the branches of awakening, such as the foundations of mindfulness, the authentic eliminations, the bases of miraculous powers, the faculties and the powers, as well as tranquility and insight.

source: །འཁོར་བའི་རྒྱ་མཚོ་ལས་རྒལ་བ་ཞེས་བྱའོ། །ཕ་རོལ་ཏུ་བྱོན་པ་ཞེས་བྱའོ། །ཐང་ལ་བྱོན་པ་ཞེས་བྱའོ། །བདེ་བ་བརྙེས་པ་ཞེས་བྱའོ། །མི་བསྙེངས་པ་བརྙེས་པ་ཞེས་བྱའོ། །ཉོན་མོངས་པའི་ཚེར་མ་དཀྲུགས་པ་ཞེས་བྱའོ། །
en: “He is the one who crossed the ocean of saṃsāra, the one who came to the other shore, the one who has reached dry land, the one who attained peace, the one who found fearlessness, and the one who is unharmed by the thorns of disturbing emotions.

source: སྐྱེས་བུ་ཞེས་བྱའོ། །སྐྱེས་བུ་ཆེན་པོ་ཞེས་བྱའོ། །སྐྱེས་བུ་སེང་གེ་ཞེས་བྱའོ། །འཇིགས་པ་དང་སྤུ་ཟིང་ཞེས་བྱེད་པ་མི་མངའ་བ་ཞེས་བྱའོ། །གླང་པོ་ཞེས་བྱའོ། །དྲི་མ་མེད་པ་ཞེས་བྱའོ། །དྲི་མ་གསུམ་སྤངས་པ་ཞེས་བྱའོ། །རིག་པ་པོ་ཞེས་བྱའོ། །རིག་པ་གསུམ་བརྙེས་པ་ཞེས་བྱའོ། །ཆུ་བོ་བཞི་ལས་རྒལ་བ་ཞེས་བྱའོ། །རིན་པོ་ཆེའི་གདུགས་འཛིན་པ་གཅིག་པུར་གྱུར་པའི་ཕྱིར་རྒྱལ་རིགས་ཞེས་བྱའོ།
en: “He is known as the person, the great person, the lion of a man, the one who is not subject to fear and the thrill of excitement, the elephant, the stainless one, the one who has abandoned the three stains, the knower, the one with the three types of insight, the one who has crossed the four rivers, and the one who has reached the other shore. “He is known as the member of the royal class because he is the only one who carries the jewel parasol.

source: །སྡིག་པའི་ཆོས་སྤངས་པའི་ཕྱིར་བྲམ་ཟེ་ཞེས་བྱའོ།
en: He is known as the priest because he abandons misguided religions.

source: །མ་རིག་པའི་སྒོ་ངའི་སྦུབས་བཅོམ་པའི་ཕྱིར་དགེ་སློང་ཞེས་བྱའོ།
en: He is known as the monk because he smashes the eggshells of ignorance.

source: །ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་དགེ་སྦྱོང་ཞེས་བྱའོ།
en: He is known as the spiritual practitioner because he is genuinely beyond attachment to money and gain.

source: །ཉོན་མོངས་པ་གཟིགས་པའི་ཕྱིར་གཙང་སྦྲ་ཅན་ཞེས་བྱའོ།
en: He is conversant with sacred knowledge.

source: །སྟོབས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: He is known as the one whose disturbing emotions have departed.

source: །སྟོབས་བཅུ་མངའ་བ་ཞེས་བྱའོ། །བཅོམ་ལྡན་འདས་ཞེས་བྱའོ། །སྐུ་བསྒོམས་པ་ཞེས་བྱའོ། །རྒྱལ་པོའི་ཡང་རྒྱལ་པོ་ཞེས་བྱའོ། །ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །ཆོས་ཀྱི་འཁོར་ལོ་མཆོག་དམ་པ་བསྐོར་ཞིང་རྗེས་སུ་སྟོན་པ་ཞེས་བྱའོ། །མི་འཁྲུགས་པའི་ཆོས་སྟོན་པ་ཞེས་བྱའོ། །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་དབང་བསྐུར་བ་ཞེས་བྱའོ། །ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ཆེན་པོ་དྲི་མ་མེད་ཅིང་རྣམ་པར་གྲོལ་བའི་གོ་འཕང་གི་ཐབས་བརྙེས་པ་ཞེས་བྱའོ།
en: “He is called the powerful one, the holder of the ten powers, the blessed one, the one who has developed physical restraint, the king among kings, the king of Dharma, the one who turns and teaches the sacred and supreme wheel of Dharma, the one who teaches a Dharma that is without strife, and the one who grants consecration into omniscient wisdom. “He is the one who is bound with a stainless headband of liberation, great wisdom, and nonattachment.

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གྱི་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: He is the one who possesses the gems of the seven branches of awakening.

source: །ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁྱད་པར་བརྙེས་པ་ཞེས་བྱའོ།
en: He is the one who has actualized all the distinctive qualities of the Dharma.

source: །བློན་པོ་འཕགས་པའི་ཉན་ཐོས་ཐམས་ཅད་ཀྱིས་ཞལ་གྱི་དཀྱིལ་འཁོར་དུ་བལྟས་པ་ཞེས་བྱའོ།
en: He is the one whose round face is gazed upon by all ministers and noble listeners.

source: །སྲས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འཁོར་ཅན་ཞེས་བྱའོ། །
en: He is the one who is surrounded by his sons the bodhisattvas, the great beings.

source: གདུལ་བ་ཤིན་ཏུ་བཏུལ་བ་ཞེས་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་ལེགས་པར་ལུང་བསྟན་པ་ཞེས་བྱའོ། །
en: He is called the one who is exceedingly gentle through discipline, and the one who can easily predict the future awakening of a bodhisattva.

source: རྣམ་ཐོས་ཀྱི་བུ་དང་འདྲ་བ་ཞེས་བྱའོ། །འཕགས་པའི་ནོར་བདུན་གྱི་མཛོད་བྱིན་པ་ཞེས་བྱའོ། །ལྷུག་པར་གཏོང་བ་ཞེས་བྱའོ། །བདེ་བ་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱའོ། །རེ་བ་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱའོ། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བས་རྗེས་སུ་སྐྱོང་བ་ཞེས་བྱའོ།
en: “He is called the one who is like Vaiśravaṇa, the one who grants the treasury of the seven noble riches, the one who sees clearly, the one who has renounced renunciation, the one who is in possession of all perfect kinds of bliss, the one who fulfills all hopes, and the one who sustains the entire world with assistance and happiness.

source: །དབང་པོ་དང་མཚུངས་པ་ཞེས་བྱའོ། །ཡེ་ཤེས་མཆོག་གི་རྡོ་རྗེ་འཆང་བ་ཞེས་བྱའོ། །ཀུན་ནས་སྤྱན་ཞེས་བྱའོ། །ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མི་མངའ་བར་གཟིགས་པ་ཞེས་བྱའོ།
en: “He is said to be like Śakra, holder of the vajra of the power of wisdom, and the one with eyes that see all around.

source: །ཡེ་ཤེས་ཀྱིས་ཀུན་ཏུ་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱའོ། །ཆོས་ཀྱི་གར་གྱི་རྒྱུད་རྒྱ་ཆེན་པོ་སྟོན་པ་ལ་ཞུགས་པ་ཞེས་བྱའོ། །
en: He is known as the one who sees all phenomena with unobscured wisdom, the one who is transformed through wisdom in every respect, and the one who displays the great dance of Dharma.

source: ཟླ་བ་དང་མཚུངས་པ་ཞེས་བྱའོ། །འགྲོ་བ་ཐམས་ཅད་ཀྱིས་བལྟ་བས་མི་ངོམས་པ་ཞེས་བྱའོ། །འོད་རྣམ་པར་དག་ཅིང་ཀུན་དུ་ཡངས་པ་ཞེས་བྱའོ། །དགའ་བ་དང་མཆོག་ཏུ་དགའ་བར་མཛད་པའི་འོད་ཅེས་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་ཕྱོགས་ཤིང་གཟིགས་པར་སྣང་བ་ཞེས་བྱའོ། །འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པའི་སྣོད་ཇི་ལྟ་བ་བཞིན་དུ་སྣང་བ་བརྙེས་པ་ཞེས་བྱའོ། །བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །སློབ་པ་དང་མི་སློབ་པའི་སྐར་མའི་ཚོགས་ཀྱི་འཁོར་ཅན་ཞེས་བྱའོ།
en: “He is like the moon, the one that beings never tire of beholding, the one with brilliant light that reaches everywhere, the light that grants friendly disposition and great delight, the light that sees all sentient beings face-to-face, the one that shines on the minds and thoughts of all beings so that they appear exactly as they are, the great array, and the one surrounded by the stars of those who learn and those who no longer learn.

source: །ཉི་མའི་དཀྱིལ་འཁོར་དང་མཚུངས་པ་ཞེས་བྱའོ། །མུན་པ་མུན་ནག་བསལ་བ་ཞེས་བྱའོ།
en: “He is called the one like the disk of the sun, and the one who clears away the darkness of delusion.

source: །ཏོག་ཆེན་པོ་དང་ལྡན་པའི་རྒྱལ་པོ་ཞེས་བྱའོ།
en: He is the king who holds the great banner.

source: །འོད་ཟེར་ཚད་མེད་ཅིང་མཐའ་ཡས་པ་ཞེས་བྱའོ།
en: He is limitless and boundless light.

source: །སྣང་བ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་པ་ཞེས་བྱའོ།
en: He is the one who illumines all with the great light.

source: །དྲིས་པ་ཐམས་ཅད་ལུང་བསྟན་པ་སྟོན་པ་ལ་རྨོངས་པ་མི་མངའ་བ་ཞེས་བྱའོ།
en: He is never confused and so clarifies questions and offers predictions.

source: །མ་རིག་པའི་མུན་པ་ཆེན་པོ་འཇོམས་པར་མཛད་པ་ཞེས་བྱའོ།
en: He is called the one who has conquered the great darkness of ignorance.

source: །ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོས་རྣམ་པར་གཟིགས་པའི་བློ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: He is called the one who perceives everything with the great light of wisdom.

source: །རྣམ་པར་མི་རྟོག་པ་ཞེས་བྱའོ།
en: He is the nonconceptual one.

source: །བྱམས་པ་དང་སྙིང་བརྩེ་བ་དང་། སྙིང་རྗེ་ཆེན་པོས་འགྲོ་བ་ཐམས་ཅད་ལ་འོད་ཟེར་མཉམ་པར་གཏོང་ཞིང་ཡུལ་ཚད་མེད་པ་ཞེས་བྱའོ།
en: He is called the one who sends light rays equally to all sentient beings in a limitless manner through his love, care, and great compassion.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་ཅིང་རྙེད་པར་དཀའ་ལ་བལྟ་དཀའ་བའི་དཀྱིལ་འཁོར་ཅན་ཞེས་བྱའོ།
en: He is known as the one who possesses the maṇḍala of the profound perfection of wisdom that is hard to gain and hard to behold.

source: །ཚངས་པ་དང་མཚུངས་པ་ཞེས་བྱའོ། །རབ་ཏུ་ཞི་བའི་སྤྱོད་ལམ་དང་ལྡན་པ་ཞེས་བྱའོ། །སྤྱོད་ལམ་དང་སྤྱོད་པའི་ཁྱད་པར་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “He is called the one who is like Brahmā, the one whose path of a religious mendicant is exceedingly calm, and the one who is endowed with all the distinctive qualities of conduct on the path of mendicancy.

source: །གཟུགས་དམ་པ་མངའ་བ་ཞེས་བྱའོ། །བལྟ་བས་མི་ངོམས་པ་ཞེས་བྱའོ།
en: He is the one with the supreme form beautiful to behold.

source: །དབང་པོ་ཞི་བ་ཞེས་བྱའོ། །ཡིད་ཞི་བ་ཞེས་བྱའོ། །ཞི་གནས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱའོ། །ཞི་གནས་དམ་པ་བརྙེས་པ་ཞེས་བྱའོ། །དུལ་བ་དང་ཞི་གནས་མཆོག་བརྙེས་པ་ཞེས་བྱའོ། །ཞི་གནས་དང་ལྷག་མཐོང་གི་ཚོགས་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱའོ།
en: He is the one with calm faculties, the one with the peaceful mind, the one who has perfected tranquility, the one who has obtained ultimate tranquility, the one who has obtained perfect discipline and tranquility, and the one who has perfected tranquility and insight.

source: །སྦས་པ་དང་། དབང་པོ་ཐུལ་བ་དང་། གླང་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ་དང་། མཚོ་ལྟར་རྙོག་པ་མེད་ཅིང་དང་བ་ཞེས་བྱའོ།
en: “Concealed and with senses subdued, he is very restrained like an elephant. He is stainless, pure, and calm like a lake.

source: །ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ལེགས་པར་སྤངས་པ་ཞེས་བྱའོ།
en: He is the one who has fully abandoned all obscurations of habitual tendencies and disturbing emotions.

source: །སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་ཞེས་བྱའོ།
en: He is endowed with the thirty-two marks of a great being.

source: །སྐྱེས་བུ་མཆོག་ཅེས་བྱའོ།
en: He is called the supreme being.

source: །དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་འཁོར་སྣ་ཚོགས་ཀྱིས་སྐུ་སྤྲས་པ་ཞེས་བྱའོ།
en: His body is beautifully embellished with the eighty excellent signs.

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་ཅེས་བྱའོ།
en: He is the foremost among men.

source: །སྟོབས་བཅུ་དང་ལྡན་པ་ཞེས་བྱའོ། །མི་འཇིགས་པ་བཞི་བརྙེས་པ་ཞེས་བྱའོ། །སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ཞེས་བྱའོ། །སྟོན་པ་ཞེས་བྱའོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱའོ།
en: He is the one with the ten powers, the charioteer of those to be guided by the unexcelled being who possesses the four types of confidence, the teacher, and the one who has perfected the eighteen unique qualities of a buddha.

source: །སྐུ་དང་གསུང་དང་ཐུགས་ཀྱི་འཕྲིན་ལས་ཀྱི་མཐའ་མ་སྨད་པ་ཞེས་བྱའོ།
en: “He is the one whose physical, verbal, and mental activity is beyond blame.

source: །རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་ཕྱིར་ཤིན་ཏུ་ཡོངས་སུ་སྦྱངས་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་མངའ་བ་ཞེས་བྱའོ།
en: He is endowed with all supreme aspects and therefore is known as the one who has purified the surface of the mirror of wisdom.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མཉམ་པ་ཉིད་དུ་མངོན་པར་ཐུགས་སུ་ཆུད་པའི་ཕྱིར་སྟོང་པ་ཉིད་ལ་གནས་པ་ཞེས་བྱའོ།
en: Because he has realized equality in relation to dependent origination, he is the one who abides in emptiness.

source: །དོན་དམ་པའི་བདེན་པའི་ཚུལ་རབ་ཏུ་རྟོགས་པའི་ཕྱིར་མཚན་མ་མེད་པ་ལ་གནས་པ་ཞེས་བྱའོ།
en: Because he realizes the way of the ultimate truth, he is the one who abides in signlessness.

source: །འཇུག་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པའི་ཕྱིར་སྨོན་པ་མེད་པ་ལ་གནས་པ་ཞེས་བྱའོ།
en: Since he is unstained by any undertaking, he abides in wishlessness.

source: །འདུ་བྱེད་ཐམས་ཅད་ཀྱི་རྒྱུན་བཅད་པའི་ཕྱིར། མངོན་པར་འདུ་མཛད་པ་མི་མངའ་བ་ཞེས་བྱའོ།
en: “Since he cuts the stream of all formations, he is not within the sphere of performance.

source: །ཡང་དག་པའི་མཐའི་ཡེ་ཤེས་ཀྱི་ཡུལ་རྣམ་པར་མི་འཁྲུགས་པའི་ཕྱིར། །ཡང་དག་པར་གསུང་བ་ཞེས་བྱའོ།
en: Since his sphere of wisdom is not disturbed regarding the authentic limit, he is known as the one who speaks the truth.

source: །དེ་བཞིན་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དང་ནམ་མཁའི་མཚན་ཉིད་ཤེས་པའི་ཡུལ་ཡིན་པའི་ཕྱིར་མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། །གཞན་མ་ཡིན་པ་གསུང་བ་ཞེས་བྱའོ།
en: Because he knows suchness, the realm of phenomena, to be like space, neither with nor without characteristics, he is known as the one who unerringly teaches suchness and nothing else.

source: །ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། རྨི་ལམ་དང་། ཆུ་ཟླ་དང་། བྲག་ཅ་དང་། མིག་ཡོར་དང་མཚུངས་པར་གནས་པའི་ཕྱིར་ཉོན་མོངས་པ་མེད་པའི་ཆོས་ཤིན་ཏུ་རྟོགས་པ་ཞེས་བྱའོ།
en: “Since he understands that all phenomena are like an illusion, a mirage, a dream, a reflection of the moon in water, an echo, and a hallucination, he is known as the one who realizes the teaching that is free of disturbing emotions.

source: །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་རྒྱུ་སྐྱེད་པའི་ཕྱིར་མཐོང་བ་དང་ཐོས་པ་དོན་ཡོད་པ་ཞེས་བྱའོ།
en: Because he produces the cause of passing beyond suffering, he is meaningful to see and to hear.

source: །སེམས་ཅན་གདུལ་བར་བཏུལ་བའི་རྩལ་དང་ལྡན་པའི་ཕྱིར་གོམ་པ་འདོར་བ་དོན་ཡོད་པ་ཞེས་བྱའོ།
en: Because he has the heroic capacity to guide sentient beings, he is called the one who strides with unerring steps.

source: །མ་རིག་པ་དང་སྲིད་པའི་སྲེད་པ་ཡང་དག་པར་བཅད་པའི་ཕྱིར་འོབས་ལས་རྒལ་བ་ཞེས་བྱའོ།
en: Because he has cut through ignorance and the craving for existence, he is known as the one who is free from weariness.

source: །ངེས་པར་འབྱིན་པའི་ལམ་ལེགས་པར་བསྟན་པའི་ཕྱིར་ཟམ་པ་བཏགས་པ་ཞེས་བྱའོ།
en: “Because he correctly teaches the liberating path, he is known as the one who has built the bridge.

source: །བདུད་ཀྱི་ཡུལ་དང་སྤྱོད་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པའི་ཕྱིར་བདུད་དང་ཉོན་མོངས་པའི་ཕྱིར་རྒོལ་བ་ལས་རྒྱལ་བ་ཞེས་བྱའོ།
en: Because he is not sullied by any demonic activities and places, he is known as the one who has defeated the enemies of demons and disturbing emotions.

source: །འདོད་པའི་ཁམས་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་འདོད་པའི་འདམ་ལས་རྒལ་བ་ཞེས་བྱའོ།
en: He has genuinely transcended the desire realm and therefore he is called the one who crossed the swamp of desire.

source: །གཟུགས་ཀྱི་ཁམས་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་ང་རྒྱལ་གྱི་རྒྱལ་མཚན་བསྙལ་བ་ཞེས་བྱའོ།
en: He has genuinely transcended the form realm and therefore he is called the one who has put down the banner of pride.

source: །གཟུགས་མེད་པའི་ཁམས་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བ་ཞེས་བྱའོ།
en: He has genuinely transcended the formless realm and therefore he is called the one who hoists the banner of wisdom.

source: །ཆོས་ཀྱི་སྐུ་དང་ཡེ་ཤེས་ཀྱི་སྐུ་དང་ལྡན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱའོ།
en: “Because he is endowed with the Dharma body and the wisdom body, he is genuinely beyond all worldly concerns.

source: །ཡོན་ཏན་རིན་པོ་ཆེའི་ཡེ་ཤེས་ཀྱི་མེ་ཏོག་མཐའ་ཡས་པ་ཤིན་ཏུ་རྒྱས་ཤིང་རྣམ་པར་གྲོལ་བའི་འབྲས་བུ་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་པའི་ཕྱིར་སྡོང་པོ་ཆེན་པོ་ཞེས་བྱའོ།
en: He is called the great tree because he blossoms with precious wisdom of limitless qualities and is endowed with the fruits of liberation.

source: །འབྱུང་བ་དང་མཐོང་བ་རྙེད་པར་དཀའ་བའི་ཕྱིར་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་དང་མཚུངས་པ་ཞེས་བྱའོ།
en: He is called the one who is like the udumbara flower because it is so rare for him to appear and be seen.

source: །ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་ངེས་པར་འབྱུང་བའི་བསམ་པ་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པར་མཛད་པའི་ཕྱིར་ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དང་མཚུངས་པ་ཞེས་བྱའོ།
en: He is said to be like the king of gems, the wish-fulfilling jewel, because he has genuinely fulfilled his aim of attaining nirvāṇa according to the way.

source: །ཡུན་རིང་པོ་ནས་གཏོང་བ་དང་ཚུལ་ཁྲིམས་དང་དཀའ་ཐུབ་དང་བརྟུལ་ཞུགས་དང་། ཚངས་པར་སྤྱོད་པ་བརྟན་པོར་ཡང་དག་པར་བླངས་པས་མི་གཡོ་ཞིང་མི་སྐྱོད་པའི་ཕྱིར། ཞབས་ཤིན་ཏུ་གནས་པ་ཞེས་བྱའོ།
en: “For so long he has practiced renunciation, discipline, hardship, and religious practices in a firm and pure manner without wavering or getting weary, and therefore he is known as the One with Firmly Planted Feet.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བླ་མ་དང་། སྦྱིན་གནས་རྣམས་དང་། ཆོས་དང་ལྡན་པ་ཡོངས་སུ་སྐྱོང་བ་དང་། སྐྱབས་སུ་ལྷགས་པ་རྣམས་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར། །ཞབས་ཀྱི་མཐིལ་བཀྲ་ཤིས་དང་གཡུང་དྲུང་འཁྱིལ་པ་དང་། འཁོར་ལོ་རྩིབས་སྟོང་དང་ལྡན་པ་སྣ་ཚོགས་ཀྱི་མཚན་དང་ལྡན་པ་ཞེས་བྱའོ།
en: “For so long parents, monks, priests, spiritual teachers, worthy people, and religious people have been protected and defended by him, and those who have taken refuge with him are never abandoned, so therefore he is said to have the soles of his feet marked with various swastikas, auspicious symbols, and thousand-spoked wheels.

source: །ཡུན་རིང་པོ་ནས་སྲོག་གཅོད་པ་སྤངས་པའི་ཕྱིར་ཞབས་ཀྱི་རྟིང་པ་ཡངས་པ་ཞེས་བྱའོ།
en: “For so long he has abandoned killing and therefore he is the One with Broad Heels.

source: །ཡུན་རིང་པོ་ནས་སེམས་ཅན་གཞན་སྲོག་གཅོད་པ་སྤང་བ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པའི་ཕྱིར་ཕྱག་གི་སོར་མོ་རིང་བ་ཞེས་བྱའོ།
en: “For so long he has inspired others to abandon killing living beings, so he is the One with Long Fingers.

source: །ཡུན་རིང་པོ་ནས་སྲོག་གཅོད་པ་སྤང་བའི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་མཛད་པ་དང་། སྐྱེ་བོ་མང་པོའི་སྐྱབས་མཛད་པའི་ཕྱིར། སྐུ་ཆེ་ཞིང་དྲང་བ་ཞེས་བྱའོ།
en: “For so long he has explained the benefits of desisting from killing, so he is called the Protector of Many People.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བླ་མ་དང་། སྦྱིན་གནས་ལ་བསྙེན་བཀུར་དང་ཡོངས་སུ་སྤྱད་པ་བྱེད་ཅིང་བཀྲུ་བ་དང་། བྱུག་པ་དང་། མར་དང་། འབྲུ་མར་གྱིས་སྐུད་ཅིང་ལག་དར་ཏེ་ལུས་ལ་སྤྱད་པ་བྱེད་པས་ཡོངས་སུ་མི་སྐྱོ་བའི་ཕྱིར། ཕྱག་དང་ཞབས་འཇམ་ཞིང་མཉེན་པ་ཞེས་བྱའོ།
en: “For so long he has exerted himself in preparing his own hands and his own body by rubbing them with ghee and sesame oil, and then using his hands for bathing and anointing the bodies of parents, monks, priests, spiritual teachers, and worthy people as part of his devoted service to them, so he is the One with Soft and Smooth Hands and Feet.

source: །བསྡུ་བའི་དངོས་པོ་བཞི་པོ་སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་བྱེད་པ་དང་། དོན་འཐུན་པའི་དྲ་བས་སེམས་ཅན་བསྡུ་བ་ལ་མཁས་པ་ལེགས་པར་བསླབས་པའི་ཕྱིར་ཕྱག་དང་ཞབས་དྲ་བས་འབྲེལ་བ་ཞེས་བྱའོ།
en: “For a long time, with the net of the four means of attracting disciples—generosity, kind talk, meaningful actions, and practicing what one preaches—he has skillfully trained the multitudes of beings, so he is the One with Webbed Fingers and Toes.

source: །ཡུན་རིང་པོ་ནས་གོང་ནས་གོང་དུ་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པ་ལ་ལྷག་པར་དམིགས་པའི་ཕྱིར་ཞབས་མཐོ་བ་ཞེས་བྱའོ།
en: “For so long he has been acquiring increasingly superior roots of virtue, so he is the One with Arched Feet.

source: །ཡུན་རིང་པོ་ནས་ཕ་མ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། བླ་མ་དང་། སྦྱིན་གནས་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་སྐོར་བ་བྱེད་པ་དང་། ལུས་ཀྱི་ལས་དང་། གུས་པར་ཆོས་ཉན་ཅིང་སྤུ་ཟིང་ཞེས་བྱེད་པ་དང་། སེམས་ཅན་གཞན་ཡང་དག་པར་དགའ་བར་བྱེད་པ་དང་། ཆོས་སྟོན་པ་ལ་སྦྱོར་བའི་ཕྱིར་ཡན་ལག་གི་སྤུ་གྱེན་དུ་གཡས་སུ་འཁྱིལ་བར་མངོན་པར་གྲུབ་པ་ཞེས་བྱའོ།
en: “For so long he has circumambulated parents, monks, priests, spiritual teachers, worthy people, and memorials with relics of the thus-gone ones, respectfully listened to the Dharma, painted images, had his hair stand on end, and caused the same rapture in others by teaching the Dharma, so he is the One Who Has the Hair on His Head Curling to the Right.

source: །ཡུན་རིང་པོ་ནས་བསྟི་སྟང་དུ་བྱས་ཏེ། ཆོས་ཉན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཤེས་པར་བྱེད་པ་དང་། དོན་དང་ཚིག་རྣམ་པར་ངེས་པར་རྟོག་པ་ལ་མཁས་པས་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་ལ་མངོན་དུ་ཕྱོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ལ་སྐྱབས་སུ་འགྲོ་བ་སྦྱིན་པ་དང་། བསྟི་སྟང་དུ་བྱས་ཏེ་ཆོས་སྟོན་ཅིང་མི་བརྙས་པའི་བློ་དང་ལྡན་པའི་ཕྱིར་བྱིན་པ་རི་དགས་ཨེ་ན་ཡའི་ལྟ་བུ་ཞེས་བྱ་བའོ།
en: “For so long, with great skill, he has paid respect and listened to the Dharma, understood it, memorized it, recited it, caused others to understand it, ascertained the meaning and the words, and with a mind of humility offered refuge to beings faced with old age, sickness, and death, and respectfully explained the Dharma to them, so he is the One with Shanks like an Antelope.

source: །ཡུན་རིང་པོ་ནས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་རྣམས་དང་། དེ་ལས་གཞན་པ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཚངས་པར་སྤྱོད་པའི་རྗེས་སུ་གཟུང་བའི་ཡོ་བྱད་ཐམས་ཅད་སྦྱིན་པ་དང་། སྒྲེན་མོ་རྣམས་ལ་གོས་སྦྱིན་པ་དང་། གཞན་གྱི་ཆུང་མ་ལ་མི་འཕྱོ་བ་དང་། ཚངས་པར་སྤྱོད་པའི་ཡོན་ཏན་གྱི་བསྔགས་པ་བརྗོད་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་རྗེས་སུ་བསྲུང་བ་བརྟན་པོར་ཡང་དག་པར་བླངས་པའི་ཕྱིར་མདོམས་ཀྱི་སྦ་བ་སྦུབས་སུ་ནུབ་པ་ཞེས་བྱའོ།
en: “For so long he has steadfastly applied himself to praising the religious life of monks, priests, and other religious practitioners, and giving them all the necessary supplies. He has given clothing to the naked and never approached another man’s woman. He has explained the virtues of spiritual practice and preserved his self-dignity, and therefore he is the One Who Has His Private Parts Well Sheathed.

source: །ཡུན་རིང་པོ་ནས་ལག་པ་དང་རྐང་པ་སྦོམ་པ་དང་། སེམས་ཅན་ལ་མི་འཚེ་བར་སྦྱོར་བ་དང་། ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་བྱམས་པ་དང་ལྡན་པའི་ཕྱིར་ཕྱག་རིང་བ་ཞེས་བྱའོ།
en: “For so long the loving actions of his body, speech, and mind have been directed toward not harming living beings, by means of guarding his arms and legs. Therefore he is the One with Long Hands.
